RhinoInside.Revit API Documentation
GeometryDecoder.ToCurves Method
 Converts the specified CurveArray to an equivalent Rhino Curve array.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8021
Syntax
public static Rhino.Geometry.Curve[] ToCurves(
	this Autodesk.Revit.DB.CurveArray value
)
@staticmethod
def ToCurves(
	value: Autodesk.Revit.DB.CurveArray
) -> Rhino.Geometry.Curve[]
Parameters
value
Type: Autodesk.Revit.DB.CurveArray
A value to convert.
Return Value
Type: Rhino.Geometry.Curve[]
A Rhino Curve array that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.CurveArray. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace